[Survived] ArrayDeclaration
src/lib/pendingInvitations.ts:45:51
 
 // ─── Module-level listener store (for useSyncExternalStore) ──────────────────
 
-let _snapshot: ReadonlyArray<PendingInvitation> = [];
+let _snapshot: ReadonlyArray<PendingInvitation> = ["Stryker was here"];
 const _listeners = new Set<() => void>();
 

[Killed] BlockStatement
src/lib/pendingInvitations.ts:48:18
 let _snapshot: ReadonlyArray<PendingInvitation> = [];
 const _listeners = new Set<() => void>();
 
-function _emit() {
-  _listeners.forEach((l) => l());
-}
+function _emit() {}
 
 /** Subscribe to invitation queue changes — for useSyncExternalStore. */
killedBy: enqueuePendingInvitation emits to listeners (subscribe/getSnapshot reactivity)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/lib/pendingInvitations.ts:49:22
 const _listeners = new Set<() => void>();
 
 function _emit() {
-  _listeners.forEach((l) => l());
+  _listeners.forEach(() => undefined);
 }
 
killedBy: enqueuePendingInvitation emits to listeners (subscribe/getSnapshot reactivity)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/pendingInvitations.ts:53:61
 }
 
 /** Subscribe to invitation queue changes — for useSyncExternalStore. */
-export function subscribe(listener: () => void): () => void {
-  _listeners.add(listener);
-  return () => _listeners.delete(listener);
-}
+export function subscribe(listener: () => void): () => void {}
 
 /** Snapshot accessor — for useSyncExternalStore. Initialised lazily. */
killedBy: enqueuePendingInvitation emits to listeners (subscribe/getSnapshot reactivity)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/lib/pendingInvitations.ts:55:10
 /** Subscribe to invitation queue changes — for useSyncExternalStore. */
 export function subscribe(listener: () => void): () => void {
   _listeners.add(listener);
-  return () => _listeners.delete(listener);
+  return () => undefined;
 }
 
killedBy: subscribe — unsubscribe stops future notifications (AC-REACT-6) unsubscribed listener is not called on subsequent mutations
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/lib/pendingInvitations.ts:59:65
 }
 
 /** Snapshot accessor — for useSyncExternalStore. Initialised lazily. */
-export function getSnapshot(): ReadonlyArray<PendingInvitation> {
-  return _snapshot;
-}
+export function getSnapshot(): ReadonlyArray<PendingInvitation> {}
 
 // ─── Internal helpers ─────────────────────────────────────────────────────────
killedBy: enqueuePendingInvitation emits to listeners (subscribe/getSnapshot reactivity)
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] BlockStatement
src/lib/pendingInvitations.ts:65:45
 
 // ─── Internal helpers ─────────────────────────────────────────────────────────
 
-function isLocalStorageAvailable(): boolean {
-  try {
-    return typeof localStorage !== 'undefined' && localStorage !== null;
-  } catch {
-    return false;
-  }
-}
+function isLocalStorageAvailable(): boolean {}
 
 function readRaw(): PendingInvitation[] {
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/pendingInvitations.ts:66:7
 // ─── Internal helpers ─────────────────────────────────────────────────────────
 
 function isLocalStorageAvailable(): boolean {
-  try {
-    return typeof localStorage !== 'undefined' && localStorage !== null;
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:67:51
 
 function isLocalStorageAvailable(): boolean {
   try {
-    return typeof localStorage !== 'undefined' && localStorage !== null;
+    return typeof localStorage !== 'undefined' && localStorage === null;
   } catch {
     return false;
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:67:12
 
 function isLocalStorageAvailable(): boolean {
   try {
-    return typeof localStorage !== 'undefined' && localStorage !== null;
+    return false;
   } catch {
     return false;
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[NoCoverage] BlockStatement
src/lib/pendingInvitations.ts:68:11
 function isLocalStorageAvailable(): boolean {
   try {
     return typeof localStorage !== 'undefined' && localStorage !== null;
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/lib/pendingInvitations.ts:73:41
   }
 }
 
-function readRaw(): PendingInvitation[] {
-  if (!isLocalStorageAvailable()) return [];
-  try {
-    const raw = localStorage.getItem(PENDING_INVITES_KEY);
-    if (!raw) return [];
-    const parsed = JSON.parse(raw);
-    if (!Array.isArray(parsed)) return [];
-    return parsed.filter(
-      (v): v is PendingInvitation =>
-        v !== null &&
-        typeof v === 'object' &&
-        typeof v.id === 'string' &&
-        typeof v.inviterPubkeyHex === 'string' &&
-        typeof v.receivedAt === 'number' &&
-        typeof v.welcomeEventJson === 'string',
-    );
-  } catch {
-    return [];
-  }
-}
+function readRaw(): PendingInvitation[] {}
 
 function writeRaw(invitations: PendingInvitation[]): void {
killedBy: listPendingInvitations returns an empty array when localStorage is empty
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
src/lib/pendingInvitations.ts:74:7
 }
 
 function readRaw(): PendingInvitation[] {
-  if (!isLocalStorageAvailable()) return [];
+  if (isLocalStorageAvailable()) return [];
   try {
     const raw = localStorage.getItem(PENDING_INVITES_KEY);
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:74:7
 }
 
 function readRaw(): PendingInvitation[] {
-  if (!isLocalStorageAvailable()) return [];
+  if (true) return [];
   try {
     const raw = localStorage.getItem(PENDING_INVITES_KEY);
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lib/pendingInvitations.ts:75:7
 
 function readRaw(): PendingInvitation[] {
   if (!isLocalStorageAvailable()) return [];
-  try {
-    const raw = localStorage.getItem(PENDING_INVITES_KEY);
-    if (!raw) return [];
-    const parsed = JSON.parse(raw);
-    if (!Array.isArray(parsed)) return [];
-    return parsed.filter(
-      (v): v is PendingInvitation =>
-        v !== null &&
-        typeof v === 'object' &&
-        typeof v.id === 'string' &&
-        typeof v.inviterPubkeyHex === 'string' &&
-        typeof v.receivedAt === 'number' &&
-        typeof v.welcomeEventJson === 'string',
-    );
-  } catch {
+  try {} catch {
     return [];
   }
killedBy: listPendingInvitations returns an empty array when localStorage is empty
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
src/lib/pendingInvitations.ts:77:9
   if (!isLocalStorageAvailable()) return [];
   try {
     const raw = localStorage.getItem(PENDING_INVITES_KEY);
-    if (!raw) return [];
+    if (raw) return [];
     const parsed = JSON.parse(raw);
     if (!Array.isArray(parsed)) return [];
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:77:9
   if (!isLocalStorageAvailable()) return [];
   try {
     const raw = localStorage.getItem(PENDING_INVITES_KEY);
-    if (!raw) return [];
+    if (true) return [];
     const parsed = JSON.parse(raw);
     if (!Array.isArray(parsed)) return [];
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/lib/pendingInvitations.ts:79:9
     const raw = localStorage.getItem(PENDING_INVITES_KEY);
     if (!raw) return [];
     const parsed = JSON.parse(raw);
-    if (!Array.isArray(parsed)) return [];
+    if (Array.isArray(parsed)) return [];
     return parsed.filter(
       (v): v is PendingInvitation =>
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:79:9
     const raw = localStorage.getItem(PENDING_INVITES_KEY);
     if (!raw) return [];
     const parsed = JSON.parse(raw);
-    if (!Array.isArray(parsed)) return [];
+    if (true) return [];
     return parsed.filter(
       (v): v is PendingInvitation =>
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/lib/pendingInvitations.ts:80:12
     if (!raw) return [];
     const parsed = JSON.parse(raw);
     if (!Array.isArray(parsed)) return [];
-    return parsed.filter(
-      (v): v is PendingInvitation =>
-        v !== null &&
-        typeof v === 'object' &&
-        typeof v.id === 'string' &&
-        typeof v.inviterPubkeyHex === 'string' &&
-        typeof v.receivedAt === 'number' &&
-        typeof v.welcomeEventJson === 'string',
-    );
+    return parsed;
   } catch {
     return [];
killedBy: listPendingInvitations returns empty array on invalid array elements
statusReason: expected [ { nope: true } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/lib/pendingInvitations.ts:81:7
     const parsed = JSON.parse(raw);
     if (!Array.isArray(parsed)) return [];
     return parsed.filter(
-      (v): v is PendingInvitation =>
-        v !== null &&
-        typeof v === 'object' &&
-        typeof v.id === 'string' &&
-        typeof v.inviterPubkeyHex === 'string' &&
-        typeof v.receivedAt === 'number' &&
-        typeof v.welcomeEventJson === 'string',
+      () => undefined,
     );
   } catch {
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:82:9
     if (!Array.isArray(parsed)) return [];
     return parsed.filter(
       (v): v is PendingInvitation =>
-        v !== null &&
+        v === null &&
         typeof v === 'object' &&
         typeof v.id === 'string' &&
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:82:9
     if (!Array.isArray(parsed)) return [];
     return parsed.filter(
       (v): v is PendingInvitation =>
-        v !== null &&
-        typeof v === 'object' &&
-        typeof v.id === 'string' &&
-        typeof v.inviterPubkeyHex === 'string' &&
-        typeof v.receivedAt === 'number' &&
-        typeof v.welcomeEventJson === 'string',
+        true,
     );
   } catch {
killedBy: listPendingInvitations returns empty array on invalid array elements
statusReason: expected [ { nope: true } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:83:9
     return parsed.filter(
       (v): v is PendingInvitation =>
         v !== null &&
-        typeof v === 'object' &&
+        typeof v !== 'object' &&
         typeof v.id === 'string' &&
         typeof v.inviterPubkeyHex === 'string' &&
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/lib/pendingInvitations.ts:83:9
     return parsed.filter(
       (v): v is PendingInvitation =>
         v !== null &&
-        typeof v === 'object' &&
+        true &&
         typeof v.id === 'string' &&
         typeof v.inviterPubkeyHex === 'string' &&

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:84:9
       (v): v is PendingInvitation =>
         v !== null &&
         typeof v === 'object' &&
-        typeof v.id === 'string' &&
+        typeof v.id !== 'string' &&
         typeof v.inviterPubkeyHex === 'string' &&
         typeof v.receivedAt === 'number' &&
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/lib/pendingInvitations.ts:84:9
       (v): v is PendingInvitation =>
         v !== null &&
         typeof v === 'object' &&
-        typeof v.id === 'string' &&
+        true &&
         typeof v.inviterPubkeyHex === 'string' &&
         typeof v.receivedAt === 'number' &&

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:85:9
         v !== null &&
         typeof v === 'object' &&
         typeof v.id === 'string' &&
-        typeof v.inviterPubkeyHex === 'string' &&
+        typeof v.inviterPubkeyHex !== 'string' &&
         typeof v.receivedAt === 'number' &&
         typeof v.welcomeEventJson === 'string',
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/lib/pendingInvitations.ts:85:9
         v !== null &&
         typeof v === 'object' &&
         typeof v.id === 'string' &&
-        typeof v.inviterPubkeyHex === 'string' &&
+        true &&
         typeof v.receivedAt === 'number' &&
         typeof v.welcomeEventJson === 'string',

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:86:9
         typeof v === 'object' &&
         typeof v.id === 'string' &&
         typeof v.inviterPubkeyHex === 'string' &&
-        typeof v.receivedAt === 'number' &&
+        typeof v.receivedAt !== 'number' &&
         typeof v.welcomeEventJson === 'string',
     );
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/lib/pendingInvitations.ts:86:9
         typeof v === 'object' &&
         typeof v.id === 'string' &&
         typeof v.inviterPubkeyHex === 'string' &&
-        typeof v.receivedAt === 'number' &&
+        true &&
         typeof v.welcomeEventJson === 'string',
     );

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:87:9
         typeof v.id === 'string' &&
         typeof v.inviterPubkeyHex === 'string' &&
         typeof v.receivedAt === 'number' &&
-        typeof v.welcomeEventJson === 'string',
+        typeof v.welcomeEventJson !== 'string',
     );
   } catch {
killedBy: listPendingInvitations returns stored invitations
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/lib/pendingInvitations.ts:87:9
         typeof v.id === 'string' &&
         typeof v.inviterPubkeyHex === 'string' &&
         typeof v.receivedAt === 'number' &&
-        typeof v.welcomeEventJson === 'string',
+        true,
     );
   } catch {

[Killed] BlockStatement
src/lib/pendingInvitations.ts:89:11
         typeof v.receivedAt === 'number' &&
         typeof v.welcomeEventJson === 'string',
     );
-  } catch {
-    return [];
-  }
+  } catch {}
 }
 
killedBy: listPendingInvitations returns empty array on corrupt JSON
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/lib/pendingInvitations.ts:94:59
   }
 }
 
-function writeRaw(invitations: PendingInvitation[]): void {
-  if (!isLocalStorageAvailable()) return;
-  try {
-    localStorage.setItem(PENDING_INVITES_KEY, JSON.stringify(invitations));
-    _snapshot = invitations;
-    _emit();
-  } catch {
-    // Non-fatal — storage may be full or unavailable
-  }
-}
+function writeRaw(invitations: PendingInvitation[]): void {}
 
 // ─── Public API ───────────────────────────────────────────────────────────────
killedBy: enqueuePendingInvitation adds a new invitation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/pendingInvitations.ts:95:7
 }
 
 function writeRaw(invitations: PendingInvitation[]): void {
-  if (!isLocalStorageAvailable()) return;
+  if (isLocalStorageAvailable()) return;
   try {
     localStorage.setItem(PENDING_INVITES_KEY, JSON.stringify(invitations));
killedBy: enqueuePendingInvitation adds a new invitation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:95:7
 }
 
 function writeRaw(invitations: PendingInvitation[]): void {
-  if (!isLocalStorageAvailable()) return;
+  if (true) return;
   try {
     localStorage.setItem(PENDING_INVITES_KEY, JSON.stringify(invitations));
killedBy: enqueuePendingInvitation adds a new invitation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/pendingInvitations.ts:96:7
 
 function writeRaw(invitations: PendingInvitation[]): void {
   if (!isLocalStorageAvailable()) return;
-  try {
-    localStorage.setItem(PENDING_INVITES_KEY, JSON.stringify(invitations));
-    _snapshot = invitations;
-    _emit();
-  } catch {
+  try {} catch {
     // Non-fatal — storage may be full or unavailable
   }
killedBy: enqueuePendingInvitation adds a new invitation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/pendingInvitations.ts:113:76
  * @returns A ReadonlyArray of PendingInvitation. Empty when nothing stored or
  *   localStorage is unavailable.
  */
-export function listPendingInvitations(): ReadonlyArray<PendingInvitation> {
-  const list = readRaw();
-  // Keep in-memory snapshot in sync when called (e.g. on initial render)
-  _snapshot = list;
-  return list;
-}
+export function listPendingInvitations(): ReadonlyArray<PendingInvitation> {}
 
 /**
killedBy: listPendingInvitations returns an empty array when localStorage is empty
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/lib/pendingInvitations.ts:136:22
     const current = readRaw();
 
     // Idempotency: skip if already enqueued
-    if (current.some((inv) => inv.id === invite.id)) return;
+    if (current.some(() => undefined)) return;
 
     let updated = [...current];
killedBy: enqueuePendingInvitation is idempotent — re-adding the same id does not duplicate
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:136:9
     const current = readRaw();
 
     // Idempotency: skip if already enqueued
-    if (current.some((inv) => inv.id === invite.id)) return;
+    if (false) return;
 
     let updated = [...current];
killedBy: enqueuePendingInvitation is idempotent — re-adding the same id does not duplicate
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:141:49
     let updated = [...current];
 
     // Per-inviter cap: drop oldest per-inviter entry when at cap
-    const fromInviter = updated.filter((inv) => inv.inviterPubkeyHex === invite.inviterPubkeyHex);
+    const fromInviter = updated.filter((inv) => false);
     if (fromInviter.length >= PER_INVITER_CAP) {
       logger.info('dm:walled-garden-invite-drop-per-inviter', {
killedBy: enqueuePendingInvitation enforces per-inviter cap of 8 (AC-INVITE-3)
statusReason: expected 9 to be 8 // Object.is equality

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:141:49
     let updated = [...current];
 
     // Per-inviter cap: drop oldest per-inviter entry when at cap
-    const fromInviter = updated.filter((inv) => inv.inviterPubkeyHex === invite.inviterPubkeyHex);
+    const fromInviter = updated.filter((inv) => inv.inviterPubkeyHex !== invite.inviterPubkeyHex);
     if (fromInviter.length >= PER_INVITER_CAP) {
       logger.info('dm:walled-garden-invite-drop-per-inviter', {
killedBy: enqueuePendingInvitation enforces per-inviter cap of 8 (AC-INVITE-3)
statusReason: expected 9 to be 8 // Object.is equality

[Killed] BlockStatement
src/lib/pendingInvitations.ts:142:48
 
     // Per-inviter cap: drop oldest per-inviter entry when at cap
     const fromInviter = updated.filter((inv) => inv.inviterPubkeyHex === invite.inviterPubkeyHex);
-    if (fromInviter.length >= PER_INVITER_CAP) {
-      logger.info('dm:walled-garden-invite-drop-per-inviter', {
-        inviter: invite.inviterPubkeyHex.slice(0, 8),
-        perInviterCount: fromInviter.length,
-      });
-      // Remove the oldest from that inviter (lowest receivedAt)
-      const oldestFromInviter = fromInviter.reduce((a, b) =>
-        a.receivedAt < b.receivedAt ? a : b,
-      );
-      updated = updated.filter((inv) => inv.id !== oldestFromInviter.id);
-    }
+    if (fromInviter.length >= PER_INVITER_CAP) {}
 
     // Global cap: drop oldest global entry when at cap
killedBy: enqueuePendingInvitation enforces per-inviter cap of 8 (AC-INVITE-3)
statusReason: expected 9 to be 8 // Object.is equality

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:142:9
 
     // Per-inviter cap: drop oldest per-inviter entry when at cap
     const fromInviter = updated.filter((inv) => inv.inviterPubkeyHex === invite.inviterPubkeyHex);
-    if (fromInviter.length >= PER_INVITER_CAP) {
+    if (true) {
       logger.info('dm:walled-garden-invite-drop-per-inviter', {
         inviter: invite.inviterPubkeyHex.slice(0, 8),
killedBy: enqueuePendingInvitation adds a new invitation
statusReason: expected +0 to be 1 // Object.is equality

[Survived] MethodExpression
src/lib/pendingInvitations.ts:144:18
     const fromInviter = updated.filter((inv) => inv.inviterPubkeyHex === invite.inviterPubkeyHex);
     if (fromInviter.length >= PER_INVITER_CAP) {
       logger.info('dm:walled-garden-invite-drop-per-inviter', {
-        inviter: invite.inviterPubkeyHex.slice(0, 8),
+        inviter: invite.inviterPubkeyHex,
         perInviterCount: fromInviter.length,
       });

[Killed] ArrowFunction
src/lib/pendingInvitations.ts:148:52
         perInviterCount: fromInviter.length,
       });
       // Remove the oldest from that inviter (lowest receivedAt)
-      const oldestFromInviter = fromInviter.reduce((a, b) =>
-        a.receivedAt < b.receivedAt ? a : b,
+      const oldestFromInviter = fromInviter.reduce(() => undefined,
       );
       updated = updated.filter((inv) => inv.id !== oldestFromInviter.id);
killedBy: enqueuePendingInvitation drops oldest per-inviter entry on per-inviter overflow
statusReason: expected { id: 'alice-0', …(3) } to be undefined

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:149:9
       });
       // Remove the oldest from that inviter (lowest receivedAt)
       const oldestFromInviter = fromInviter.reduce((a, b) =>
-        a.receivedAt < b.receivedAt ? a : b,
+        false ? a : b,
       );
       updated = updated.filter((inv) => inv.id !== oldestFromInviter.id);
killedBy: enqueuePendingInvitation drops oldest per-inviter entry on per-inviter overflow
statusReason: expected { id: 'alice-0', …(3) } to be undefined

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:149:9
       });
       // Remove the oldest from that inviter (lowest receivedAt)
       const oldestFromInviter = fromInviter.reduce((a, b) =>
-        a.receivedAt < b.receivedAt ? a : b,
+        a.receivedAt >= b.receivedAt ? a : b,
       );
       updated = updated.filter((inv) => inv.id !== oldestFromInviter.id);
killedBy: enqueuePendingInvitation drops oldest per-inviter entry on per-inviter overflow
statusReason: expected { id: 'alice-0', …(3) } to be undefined

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:151:41
       const oldestFromInviter = fromInviter.reduce((a, b) =>
         a.receivedAt < b.receivedAt ? a : b,
       );
-      updated = updated.filter((inv) => inv.id !== oldestFromInviter.id);
+      updated = updated.filter((inv) => false);
     }
 
killedBy: enqueuePendingInvitation enforces per-inviter cap of 8 (AC-INVITE-3)
statusReason: expected 1 to be 8 // Object.is equality

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:151:41
       const oldestFromInviter = fromInviter.reduce((a, b) =>
         a.receivedAt < b.receivedAt ? a : b,
       );
-      updated = updated.filter((inv) => inv.id !== oldestFromInviter.id);
+      updated = updated.filter((inv) => inv.id === oldestFromInviter.id);
     }
 
killedBy: enqueuePendingInvitation enforces per-inviter cap of 8 (AC-INVITE-3)
statusReason: expected 2 to be 8 // Object.is equality

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:155:9
     }
 
     // Global cap: drop oldest global entry when at cap
-    if (updated.length >= GLOBAL_CAP) {
+    if (updated.length < GLOBAL_CAP) {
       logger.info('dm:walled-garden-invite-drop-overflow', {
         inviter: invite.inviterPubkeyHex.slice(0, 8),
killedBy: enqueuePendingInvitation adds a new invitation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:155:9
     }
 
     // Global cap: drop oldest global entry when at cap
-    if (updated.length >= GLOBAL_CAP) {
+    if (updated.length > GLOBAL_CAP) {
       logger.info('dm:walled-garden-invite-drop-overflow', {
         inviter: invite.inviterPubkeyHex.slice(0, 8),
killedBy: enqueuePendingInvitation — global cap (AC-INVITE-3, distinct-inviter path) enforces global cap when each invite comes from a unique inviter (cap branch is exercised)
statusReason: expected 257 to be less than or equal to 256

[Survived] StringLiteral
src/lib/pendingInvitations.ts:156:19
 
     // Global cap: drop oldest global entry when at cap
     if (updated.length >= GLOBAL_CAP) {
-      logger.info('dm:walled-garden-invite-drop-overflow', {
+      logger.info("", {
         inviter: invite.inviterPubkeyHex.slice(0, 8),
         queueSize: updated.length,

[Survived] MethodExpression
src/lib/pendingInvitations.ts:157:18
     // Global cap: drop oldest global entry when at cap
     if (updated.length >= GLOBAL_CAP) {
       logger.info('dm:walled-garden-invite-drop-overflow', {
-        inviter: invite.inviterPubkeyHex.slice(0, 8),
+        inviter: invite.inviterPubkeyHex,
         queueSize: updated.length,
       });

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:160:48
         inviter: invite.inviterPubkeyHex.slice(0, 8),
         queueSize: updated.length,
       });
-      const oldest = updated.reduce((a, b) => (a.receivedAt < b.receivedAt ? a : b));
+      const oldest = updated.reduce((a, b) => (a.receivedAt >= b.receivedAt ? a : b));
       updated = updated.filter((inv) => inv.id !== oldest.id);
     }
killedBy: enqueuePendingInvitation — global cap (AC-INVITE-3, distinct-inviter path) drops the globally oldest entry (lowest receivedAt) when global cap fires
statusReason: expected { id: 'gc-0', …(3) } to be undefined

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:160:48
         inviter: invite.inviterPubkeyHex.slice(0, 8),
         queueSize: updated.length,
       });
-      const oldest = updated.reduce((a, b) => (a.receivedAt < b.receivedAt ? a : b));
+      const oldest = updated.reduce((a, b) => (false ? a : b));
       updated = updated.filter((inv) => inv.id !== oldest.id);
     }
killedBy: enqueuePendingInvitation — global cap (AC-INVITE-3, distinct-inviter path) drops the globally oldest entry (lowest receivedAt) when global cap fires
statusReason: expected { id: 'gc-0', …(3) } to be undefined

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:161:41
         queueSize: updated.length,
       });
       const oldest = updated.reduce((a, b) => (a.receivedAt < b.receivedAt ? a : b));
-      updated = updated.filter((inv) => inv.id !== oldest.id);
+      updated = updated.filter((inv) => true);
     }
 
killedBy: enqueuePendingInvitation — global cap (AC-INVITE-3, distinct-inviter path) enforces global cap when each invite comes from a unique inviter (cap branch is exercised)
statusReason: expected 257 to be less than or equal to 256

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:161:41
         queueSize: updated.length,
       });
       const oldest = updated.reduce((a, b) => (a.receivedAt < b.receivedAt ? a : b));
-      updated = updated.filter((inv) => inv.id !== oldest.id);
+      updated = updated.filter((inv) => inv.id === oldest.id);
     }
 
killedBy: enqueuePendingInvitation — global cap (AC-INVITE-3, distinct-inviter path) drops the globally oldest entry (lowest receivedAt) when global cap fires
statusReason: expected { id: 'gc-0', …(3) } to be undefined

[Killed] BlockStatement
src/lib/pendingInvitations.ts:176:59
  * Idempotent: no-op if the id is not in the queue.
  * Never throws.
  */
-export function removePendingInvitation(id: string): void {
-  try {
-    const current = readRaw();
-    const updated = current.filter((inv) => inv.id !== id);
-    if (updated.length !== current.length) {
-      writeRaw(updated);
-    }
-  } catch {
-    // Never throw
-  }
-}
+export function removePendingInvitation(id: string): void {}
 
 /**
killedBy: removePendingInvitation removes an existing invitation
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/pendingInvitations.ts:177:7
  * Never throws.
  */
 export function removePendingInvitation(id: string): void {
-  try {
-    const current = readRaw();
-    const updated = current.filter((inv) => inv.id !== id);
-    if (updated.length !== current.length) {
-      writeRaw(updated);
-    }
-  } catch {
+  try {} catch {
     // Never throw
   }
killedBy: removePendingInvitation removes an existing invitation
statusReason: expected 1 to be +0 // Object.is equality
