[Killed] BlockStatement
src/config/maintainer.ts:15:45
  * Fail-soft: undecodable entries are silently dropped.
  * Never throws.
  */
-function decodeNpubs(raw: string): string[] {
-  return raw
-    .split(',')
-    .map((s) => s.trim())
-    .filter((s) => s.length > 0)
-    .reduce<string[]>((acc, npub) => {
-      try {
-        const hex = npubToPubkeyHex(npub);
-        if (hex) acc.push(hex);
-      } catch {
-        // Silently drop undecodable entry
-      }
-      return acc;
-    }, []);
-}
+function decodeNpubs(raw: string): string[] {}
 
 function resolveMaintainerPubkeys(): string[] {
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] MethodExpression
src/config/maintainer.ts:16:10
  * Never throws.
  */
 function decodeNpubs(raw: string): string[] {
-  return raw
-    .split(',')
-    .map((s) => s.trim())
-    .filter((s) => s.length > 0)
+  return raw.split(',').map(s => s.trim())
     .reduce<string[]>((acc, npub) => {
       try {

[Killed] MethodExpression
src/config/maintainer.ts:18:17
 function decodeNpubs(raw: string): string[] {
   return raw
     .split(',')
-    .map((s) => s.trim())
+    .map((s) => s)
     .filter((s) => s.length > 0)
     .reduce<string[]>((acc, npub) => {
killedBy: maintainer config — env override (S2 / L33 survivor) decodes a comma-separated list of valid npubs into hex pubkeys
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/config/maintainer.ts:18:10
 function decodeNpubs(raw: string): string[] {
   return raw
     .split(',')
-    .map((s) => s.trim())
+    .map(() => undefined)
     .filter((s) => s.length > 0)
     .reduce<string[]>((acc, npub) => {
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/config/maintainer.ts:19:13
   return raw
     .split(',')
     .map((s) => s.trim())
-    .filter((s) => s.length > 0)
+    .filter(() => undefined)
     .reduce<string[]>((acc, npub) => {
       try {
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: expected 'd18c6444503864278da4417153d39b7d4fad7…' not to be 'd18c6444503864278da4417153d39b7d4fad7…' // Object.is equality

[Killed] EqualityOperator
src/config/maintainer.ts:19:20
   return raw
     .split(',')
     .map((s) => s.trim())
-    .filter((s) => s.length > 0)
+    .filter((s) => s.length <= 0)
     .reduce<string[]>((acc, npub) => {
       try {
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: expected 'd18c6444503864278da4417153d39b7d4fad7…' not to be 'd18c6444503864278da4417153d39b7d4fad7…' // Object.is equality

[Killed] BlockStatement
src/config/maintainer.ts:20:38
     .split(',')
     .map((s) => s.trim())
     .filter((s) => s.length > 0)
-    .reduce<string[]>((acc, npub) => {
-      try {
-        const hex = npubToPubkeyHex(npub);
-        if (hex) acc.push(hex);
-      } catch {
-        // Silently drop undecodable entry
-      }
-      return acc;
-    }, []);
+    .reduce<string[]>((acc, npub) => {}, []);
 }
 
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/config/maintainer.ts:21:11
     .map((s) => s.trim())
     .filter((s) => s.length > 0)
     .reduce<string[]>((acc, npub) => {
-      try {
-        const hex = npubToPubkeyHex(npub);
-        if (hex) acc.push(hex);
-      } catch {
+      try {} catch {
         // Silently drop undecodable entry
       }
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: expected 'd18c6444503864278da4417153d39b7d4fad7…' not to be 'd18c6444503864278da4417153d39b7d4fad7…' // Object.is equality

[Killed] ConditionalExpression
src/config/maintainer.ts:23:13
     .reduce<string[]>((acc, npub) => {
       try {
         const hex = npubToPubkeyHex(npub);
-        if (hex) acc.push(hex);
+        if (false) acc.push(hex);
       } catch {
         // Silently drop undecodable entry
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: expected 'd18c6444503864278da4417153d39b7d4fad7…' not to be 'd18c6444503864278da4417153d39b7d4fad7…' // Object.is equality

[Killed] ConditionalExpression
src/config/maintainer.ts:23:13
     .reduce<string[]>((acc, npub) => {
       try {
         const hex = npubToPubkeyHex(npub);
-        if (hex) acc.push(hex);
+        if (true) acc.push(hex);
       } catch {
         // Silently drop undecodable entry
killedBy: maintainer config — env override (S2 / L33 survivor) silently drops undecodable entries in a mixed list (fail-soft)
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/config/maintainer.ts:31:47
     }, []);
 }
 
-function resolveMaintainerPubkeys(): string[] {
-  const raw = getNextPublicMaintainerNpubs();
-  if (raw !== undefined && raw.trim() !== '') {
-    const decoded = decodeNpubs(raw);
-    if (decoded.length > 0) return decoded;
-  }
-  // Fall back to the built-in default
-  const defaultHex = npubToPubkeyHex(DEFAULT_MAINTAINER_NPUB);
-  return defaultHex ? [defaultHex] : [];
-}
+function resolveMaintainerPubkeys(): string[] {}
 
 /** Decoded hex pubkeys of the maintainer(s). Falls back to the built-in default. */
killedBy: maintainer config — env override (S2 / L33 survivor) uses the built-in default when env is undefined
statusReason: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
src/config/maintainer.ts:33:7
 
 function resolveMaintainerPubkeys(): string[] {
   const raw = getNextPublicMaintainerNpubs();
-  if (raw !== undefined && raw.trim() !== '') {
+  if (raw !== undefined || raw.trim() !== '') {
     const decoded = decodeNpubs(raw);
     if (decoded.length > 0) return decoded;
killedBy: maintainer config — env override (S2 / L33 survivor) uses the built-in default when env is undefined
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/config/maintainer.ts:33:7
 
 function resolveMaintainerPubkeys(): string[] {
   const raw = getNextPublicMaintainerNpubs();
-  if (raw !== undefined && raw.trim() !== '') {
+  if (true && raw.trim() !== '') {
     const decoded = decodeNpubs(raw);
     if (decoded.length > 0) return decoded;
killedBy: maintainer config — env override (S2 / L33 survivor) uses the built-in default when env is undefined
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/config/maintainer.ts:35:9
   const raw = getNextPublicMaintainerNpubs();
   if (raw !== undefined && raw.trim() !== '') {
     const decoded = decodeNpubs(raw);
-    if (decoded.length > 0) return decoded;
+    if (decoded.length <= 0) return decoded;
   }
   // Fall back to the built-in default
killedBy: maintainer config — env override (S2 / L33 survivor) uses env list when env contains a valid npub (overrides default entirely)
statusReason: expected 'd18c6444503864278da4417153d39b7d4fad7…' not to be 'd18c6444503864278da4417153d39b7d4fad7…' // Object.is equality

[Killed] EqualityOperator
src/config/maintainer.ts:35:9
   const raw = getNextPublicMaintainerNpubs();
   if (raw !== undefined && raw.trim() !== '') {
     const decoded = decodeNpubs(raw);
-    if (decoded.length > 0) return decoded;
+    if (decoded.length >= 0) return decoded;
   }
   // Fall back to the built-in default
killedBy: maintainer config — env override (S2 / L33 survivor) falls back to default when env is set but all entries are undecodable
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] LogicalOperator
src/config/maintainer.ts:49:60
  * The primary maintainer pubkey for outbound DMs.
  * Null when the list is empty, which disables the feedback feature.
  */
-export const MAINTAINER_ACTIVE_PUBKEY_HEX: string | null = MAINTAINER_PUBKEYS_HEX[0] ?? null;
+export const MAINTAINER_ACTIVE_PUBKEY_HEX: string | null = MAINTAINER_PUBKEYS_HEX[0] && null;
 
 /** Display name shown in the feedback UI. */
killedBy: maintainer config — env override (S2 / L33 survivor) exposes the first decoded entry as MAINTAINER_ACTIVE_PUBKEY_HEX
statusReason: expected null to be '82341f882b6eabcd2ba7f1ef90aad961cf074…' // Object.is equality

[Killed] BlockStatement
src/config/maintainer.ts:55:58
 export const MAINTAINER_DISPLAY_NAME = 'Nostling Team';
 
 /** Returns true when the given hex pubkey belongs to a maintainer. Case-insensitive. */
-export function isMaintainerPubkey(hex: string): boolean {
-  const lower = hex.toLowerCase();
-  return MAINTAINER_PUBKEYS_HEX.some((pk) => pk.toLowerCase() === lower);
-}
+export function isMaintainerPubkey(hex: string): boolean {}
 
killedBy: isMaintainerPubkey — multi-maintainer list (S1 / L57 survivor) returns true for the FIRST maintainer in a 2-entry list
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/config/maintainer.ts:56:17
 
 /** Returns true when the given hex pubkey belongs to a maintainer. Case-insensitive. */
 export function isMaintainerPubkey(hex: string): boolean {
-  const lower = hex.toLowerCase();
+  const lower = hex.toUpperCase();
   return MAINTAINER_PUBKEYS_HEX.some((pk) => pk.toLowerCase() === lower);
 }
killedBy: isMaintainerPubkey — multi-maintainer list (S1 / L57 survivor) returns true for the FIRST maintainer in a 2-entry list
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/config/maintainer.ts:57:46
 /** Returns true when the given hex pubkey belongs to a maintainer. Case-insensitive. */
 export function isMaintainerPubkey(hex: string): boolean {
   const lower = hex.toLowerCase();
-  return MAINTAINER_PUBKEYS_HEX.some((pk) => pk.toLowerCase() === lower);
+  return MAINTAINER_PUBKEYS_HEX.some((pk) => false);
 }
 
killedBy: isMaintainerPubkey — multi-maintainer list (S1 / L57 survivor) returns true for the FIRST maintainer in a 2-entry list
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/config/maintainer.ts:57:46
 /** Returns true when the given hex pubkey belongs to a maintainer. Case-insensitive. */
 export function isMaintainerPubkey(hex: string): boolean {
   const lower = hex.toLowerCase();
-  return MAINTAINER_PUBKEYS_HEX.some((pk) => pk.toLowerCase() === lower);
+  return MAINTAINER_PUBKEYS_HEX.some((pk) => pk.toLowerCase() !== lower);
 }
 
killedBy: isMaintainerPubkey — multi-maintainer list (S1 / L57 survivor) returns false for a non-maintainer pubkey even when list has multiple entries
statusReason: expected true to be false // Object.is equality
