[Killed] MethodExpression
src/lib/pendingInvitations.ts:179:21
 export function removePendingInvitation(id: string): void {
   try {
     const current = readRaw();
-    const updated = current.filter((inv) => inv.id !== id);
+    const updated = current;
     if (updated.length !== current.length) {
       writeRaw(updated);
killedBy: removePendingInvitation removes an existing invitation
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/lib/pendingInvitations.ts:179:36
 export function removePendingInvitation(id: string): void {
   try {
     const current = readRaw();
-    const updated = current.filter((inv) => inv.id !== id);
+    const updated = current.filter(() => undefined);
     if (updated.length !== current.length) {
       writeRaw(updated);
killedBy: removePendingInvitation does not remove other invitations
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/pendingInvitations.ts:180:9
   try {
     const current = readRaw();
     const updated = current.filter((inv) => inv.id !== id);
-    if (updated.length !== current.length) {
+    if (false) {
       writeRaw(updated);
     }
killedBy: removePendingInvitation removes an existing invitation
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/lib/pendingInvitations.ts:180:9
   try {
     const current = readRaw();
     const updated = current.filter((inv) => inv.id !== id);
-    if (updated.length !== current.length) {
+    if (updated.length === current.length) {
       writeRaw(updated);
     }
killedBy: removePendingInvitation removes an existing invitation
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/pendingInvitations.ts:191:51
 /**
  * Returns the total number of pending invitations.
  */
-export function countPendingInvitations(): number {
-  return readRaw().length;
-}
+export function countPendingInvitations(): number {}
 
 /**
killedBy: enqueuePendingInvitation adds a new invitation
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/pendingInvitations.ts:198:80
 /**
  * Returns the number of pending invitations from a specific inviter.
  */
-export function pendingInvitationsForInviter(inviterPubkeyHex: string): number {
-  return readRaw().filter((inv) => inv.inviterPubkeyHex === inviterPubkeyHex).length;
-}
+export function pendingInvitationsForInviter(inviterPubkeyHex: string): number {}
 
 // ─── Initialise snapshot on module load ──────────────────────────────────────
killedBy: enqueuePendingInvitation enforces per-inviter cap of 8 (AC-INVITE-3)
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArrowFunction
src/lib/pendingInvitations.ts:199:27
  * Returns the number of pending invitations from a specific inviter.
  */
 export function pendingInvitationsForInviter(inviterPubkeyHex: string): number {
-  return readRaw().filter((inv) => inv.inviterPubkeyHex === inviterPubkeyHex).length;
+  return readRaw().filter(() => undefined).length;
 }
 
killedBy: enqueuePendingInvitation enforces per-inviter cap of 8 (AC-INVITE-3)
statusReason: expected +0 to be 8 // Object.is equality

[Killed] MethodExpression
src/lib/pendingInvitations.ts:199:10
  * Returns the number of pending invitations from a specific inviter.
  */
 export function pendingInvitationsForInviter(inviterPubkeyHex: string): number {
-  return readRaw().filter((inv) => inv.inviterPubkeyHex === inviterPubkeyHex).length;
+  return readRaw().length;
 }
 
killedBy: pendingInvitationsForInviter counts only invitations from the specified inviter
statusReason: expected 3 to be 2 // Object.is equality

[NoCoverage] BlockStatement
src/lib/pendingInvitations.ts:205:36
 // ─── Initialise snapshot on module load ──────────────────────────────────────
 // Populate the module-level snapshot so useSyncExternalStore callers get a
 // non-empty initial state without an extra read on the first subscribe.
-if (typeof window !== 'undefined') {
-  try {
-    _snapshot = readRaw();
-  } catch {
-    // SSR or unavailable storage — leave empty
-  }
-}
+if (typeof window !== 'undefined') {}
 

[Survived] ConditionalExpression
src/lib/pendingInvitations.ts:205:5
 // ─── Initialise snapshot on module load ──────────────────────────────────────
 // Populate the module-level snapshot so useSyncExternalStore callers get a
 // non-empty initial state without an extra read on the first subscribe.
-if (typeof window !== 'undefined') {
+if (true) {
   try {
     _snapshot = readRaw();

[NoCoverage] BlockStatement
src/lib/pendingInvitations.ts:206:7
 // Populate the module-level snapshot so useSyncExternalStore callers get a
 // non-empty initial state without an extra read on the first subscribe.
 if (typeof window !== 'undefined') {
-  try {
-    _snapshot = readRaw();
-  } catch {
+  try {} catch {
     // SSR or unavailable storage — leave empty
   }
